dataset_gen/Reynolds_Variation/FPO_cylinder/Regular_complex/Design_Point_0/0/p
FoamFile
{
    version 2.0;
    format ascii;
    class volScalarField;
    object p;
}

dimensions      [0 2 -2 0 0 0 0];
internalField   uniform 0;

boundaryField
{
    left
    {
        type            zeroGradient;
    }
    right
    {
        type            fixedValue;
        value           uniform 0;
    }
    bottom
    {
        type            zeroGradient;
    }
    top
    {
        type            zeroGradient;
    }
    frontAndBack
    {
        type            empty;
    }
}

